---
kind: property
id: P:Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.IgnoreImports
source: html/e3ffa1dd-7e29-7607-7bb1-8851227978fc.htm
---
# Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.IgnoreImports Property

If true, import instances are ignored by route calculation.
 For imports to be ignored, also EnableIgnoredCategoryIds must be set to true.

## Syntax (C#)
```csharp
public bool IgnoreImports { get; set; }
```